app/Http/Controllers/AdminClinic/AppointmentController.php

select * from `appointments` where `appointments`.`clinic_id` = '9' and `appointments`.`clinic_id` is not null and `appointments`.`deleted_at` is null
---
    public function index()
    {
        $appointments = $this->clinic->appointments()->latest()->with('user')->paginate();