app/Http/Controllers/AdminClinic/AppointmentController.php

    public function index($slug)
    {
        $clinic = Clinic::where('slug', '=', $slug)->firstOrFail();
        $appointments = Appointment::where('clinic_id', '=', $clinic->id)->orderBy('created_at', 'DESC')->with('user')->paginate();
---
select * from `clinics` where `slug` = 'amina-donnelly' and `clinics`.`deleted_at` is null limit 1
select * from `appointments` where `clinic_id` = '9' and `appointments`.`deleted_at` is null order by `created_at` desc limit 15 offset 0
select * from `users` where `users`.`id` in ('8', '9', '10')
select count(*) as aggregate from `appointments` where `clinic_id` = '9' and `appointments`.`deleted_at` is null

    public function edit($slug, Appointment $appointment)
    {
        $clinic = Clinic::where('slug', '=', $slug)->firstOrFail();
---
select * from `clinics` where `slug` = 'amina-donnelly' and `clinics`.`deleted_at` is null limit 1

    public function update(Request $request, $slug, Appointment $appointment)
    {
        $clinic = Clinic::where('slug', '=', $slug)->first();
        if ($clinic->id == $appointment->clinic->id) {
            $appointment->update(['status' => $request->status]);
---
select * from `clinics` where `slug` = 'amina-donnelly' and `clinics`.`deleted_at` is null limit 1
update `appointments` set `status` = '2', `updated_at` = '2018-08-05 16:16:15' where `id` = '15'