app/Http/Controllers/AdminClinic/EventController.php

select * from `events`
---
    public function index()
    {
        $event = [];
        $data = Event::all();