app/Http/Controllers/Admin/ClinicController.php

select count(*) as aggregate from `clinics` where `clinics`.`deleted_at` is null
select * from `clinic_types` where `clinic_types`.`id` in ('8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22')
select * from `clinics` where `clinics`.`deleted_at` is null limit 15 offset 0
---
    public function index()
    {
        $clinics = Clinic::with('clinicType')->paginate();
        return view('admin.clinics.index')->with('clinics', $clinics);

update `clinics` set `deleted_at` = '2018-08-05 15:58:29', `updated_at` = '2018-08-05 15:58:29' where `id` = '1'
---
    public function destroy(Clinic $clinic)
    {
        $clinic->delete();