app/Http/Controllers/Admin/ClinicTypeController.php

select * from `clinic_types`
---
    public function index()
    {
        $clinicTypes = ClinicType::all();