app/Http/Controllers/Admin/UserController.php

    public function index()
    {
        $users = User::latest()->paginate();
---
select * from `users` limit 15 offset 0
select count(*) as aggregate from `users`